<a href="https://colab.research.google.com/github/Aniket658/GN22CDBDS001_2159919/blob/main/Assessment1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

ASSESSMENT- Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [80]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [81]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [82]:
users = pd.read_csv(url, sep='|')
users = users.set_index('user_id')

### Step 4. See the first 25 entries

In [83]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [84]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [85]:
users.shape[0]
# Number of rows in dataset

943

### Step 7. What is the number of columns in the dataset?

In [86]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [87]:
users.columns
# We can also loop through users.columns to print each column name separately.

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [88]:
users.loc[1:5, "age":"occupation"]
# Dataset is indexed both column-wise and row-wise

         age gender  occupation
user_id
1         24      M  technician
2         53      F       other
3         23      M      writer
4         24      M  technician
5         33      F       other

### Step 10. What is the data type of each column?

In [89]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [90]:
print(users["occupation"])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [91]:
users["occupation"].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### Step 13. What is the most frequent occupation?

In [92]:
users["occupation"].mode()

0    student
dtype: object

### Step 14. Summarize the DataFrame.

In [93]:
print(users.info())
users.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB
None

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [94]:
users.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [95]:
users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [96]:
users["age"].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [97]:
users["age"].value_counts().index[-1]
# 73 is the age with least occurrence of count 1.
# We can also loop through the dataframe to find all ages with least count occurrence.

73

Step 19. Write a lambda function to convert a string column to a numerical column

In [98]:
to_num = lambda x: int(x) if x.isnumeric() and type(x) is str else x
# As some of the zipcode is of format 'T8H1N' hence need to check whether it is numeric before converting it to int.

users["zip_code"].apply(to_num)
# As some of the values is not numeric i.e. 'T8H1N' hence datatype of zipcode is still object.

user_id
1      85711
2      94043
3      32067
4      43537
5      15213
       ...
939    33319
940     2215
941    97229
942    78209
943    77841
Name: zip_code, Length: 943, dtype: object